In [90]:
import numpy as np
import pandas as pd

In [108]:
company=pd.read_csv('https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/Hackathon/company.csv')
company.head(2)

   Company   Age  Salary    Place Country  Gender
0      TCS  20.0     NaN  Chennai   India       0
1  Infosys  30.0     NaN   Mumbai   India       0

1. Number of People Per company

In [92]:
company['Company'].value_counts()

TCS                          53
Infosys                      45
CTS                          36
Congnizant                    2
Infosys Pvt Lmt               2
Tata Consultancy Services     2
Name: Company, dtype: int64

2. To find the no. of M/F associates in each company

In [93]:
company.groupby(['Company','Gender']).agg({'Gender':'count'})

                                  Gender
Company                   Gender
CTS                       0           28
                          1            8
Congnizant                0            2
Infosys                   0           38
                          1            7
Infosys Pvt Lmt           0            2
TCS                       0           37
                          1           16
Tata Consultancy Services 0            1
                          1            1

3. To find the number of people working across diff locations

In [94]:
company.groupby(['Company','Place']).agg({'Place':'count'})

                                      Place
Company                   Place
CTS                       Calcutta        7
                          Chennai         3
                          Cochin          4
                          Delhi           2
                          Hyderabad       3
                          Mumbai          9
                          Noida           1
                          Podicherry      2
                          Pune            2
Congnizant                Mumbai          1
                          Noida           1
Infosys                   Bhopal          1
                          Calcutta       11
                          Chennai         3
                          Cochin          5
                          Delhi           6
                          Hyderabad       3
                          Mumbai         11
                          Noida           1
                          Podicherry      1
Infosys Pvt Lmt           Chennai         1
                          Mumbai          1
TCS                       Calcutta       13
                          Chennai         6
                          Cochin          4
                          Delhi           5
                          Hyderabad       1
                          Mumbai         13
                          Nagpur          1
                          Noida           4
Tata Consultancy Services Mumbai          1

4. To find the no. of associates working across locations

In [95]:
company['Place'].value_counts()

Mumbai        37
Calcutta      33
Delhi         14
Chennai       14
Cochin        13
Noida          8
Hyderabad      8
Podicherry     3
Pune           2
Bhopal         1
Nagpur         1
Name: Place, dtype: int64

5. To find the place where more no. of people are working

In [97]:
company['Place'].value_counts().head(1)

Mumbai    37
Name: Place, dtype: int64

6. To find the place where less no. of people are working

In [98]:
company['Place'].value_counts().tail(1)

Nagpur    1
Name: Place, dtype: int64

In [53]:
df1 = pd.read_csv('https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/Hackathon/company.csv',na_values = ['#NAME?'])
df1.isnull().sum().sort_values(ascending = False)
df_no_missing = df1.dropna(axis = 0)
print(df_no_missing.head())
df1

   Company   Age  Salary     Place Country  Gender
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0
7  Infosys  23.0  7000.0    Mumbai   India       1
8      TCS  34.0  8000.0  Calcutta   India       1

     Company   Age  Salary     Place Country  Gender
0        TCS  20.0     NaN   Chennai   India       0
1    Infosys  30.0     NaN    Mumbai   India       0
2        TCS  35.0  2300.0  Calcutta   India       0
3    Infosys  40.0  3000.0     Delhi   India       0
4        TCS  23.0  4000.0    Mumbai   India       0
..       ...   ...     ...       ...     ...     ...
143      TCS  33.0  9024.0  Calcutta   India       1
144  Infosys  22.0  8787.0  Calcutta   India       1
145  Infosys  44.0  4034.0     Delhi   India       1
146      TCS  33.0  5034.0    Mumbai   India       1
147  Infosys  22.0  8202.0    Cochin   India       0

[148 rows x 6 columns]

# Not able to impute values

In [61]:
from sklearn.preprocessing import SimpleImputer
#Import impute.SimpleImputer from sklearn
df1 = pd.read_csv('https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/Hackathon/company.csv',na_values = ['#NAME?'])

#imputer to impute missing values with mean
imp = Imputer(missing_values = 'NaN',strategy = 'mean',axis = 0)

imp.fit(df1)
df_nonull = pd.DataFrame(data = imp.transform(df1),columns = 'Salary')

ImportError: cannot import name 'SimpleImputer' from 'sklearn.preprocessing' (C:\Users\allur\anaconda3\lib\site-packages\sklearn\preprocessing\__init__.py)

In [72]:
#company = company['Company'].replace('NaN', 0, inplace = True)

9. Avg age of associates who are working in diff companies

In [142]:
company.groupby('Company')['Age'].mean()

Company
CTS                          32.194444
Congnizant                   21.500000
Infosys                      32.621622
Infosys Pvt Lmt              21.500000
TCS                          28.444444
Tata Consultancy Services    33.500000
Name: Age, dtype: float64

10. Avg age of people working only in CTS/Cognizant

In [151]:
comp=company[(company['Company']=='Congnizant') | (company['Company']=='CTS') ]
comp1=comp.groupby('Company').agg({'Age':'mean'})
comp1

                  Age
Company
CTS         32.194444
Congnizant  21.500000

11. To find the highest Salaray in each company

In [176]:
company.groupby('Company')['Salary'].max()

Company
CTS                          9876.0
Congnizant                   2934.0
Infosys                      8943.0
Infosys Pvt Lmt              8202.0
TCS                          9024.0
Tata Consultancy Services    8345.0
Name: Salary, dtype: float64

12. To find the highest Salaray gender wise

In [178]:
company.groupby(['Company','Gender'])['Salary'].max()

Company                    Gender
CTS                        0         9000.0
                           1         9876.0
Congnizant                 0         2934.0
Infosys                    0         8787.0
                           1         8943.0
Infosys Pvt Lmt            0         8202.0
TCS                        0         8000.0
                           1         9024.0
Tata Consultancy Services  0         8345.0
                           1         8345.0
Name: Salary, dtype: float64